CREATE DATABASE  IF NOT EXISTS `myPeriodics` /*!40100 DEFAULT CHARACTER SET utf16 */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `myPeriodics`;
-- MySQL dump 10.13  Distrib 8.0.19, for Linux (x86_64)
--
-- Host: localhost    Database: myPeriodics
-- ------------------------------------------------------
-- Server version	8.0.19-0ubuntu5

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `periodical`
--

DROP TABLE IF EXISTS `periodical`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `periodical` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(450) NOT NULL,
  `description` varchar(450) DEFAULT 'no description',
  `id_type` int unsigned NOT NULL,
  `id_status` int unsigned NOT NULL,
  `id_theme` int unsigned NOT NULL,
  `price_per_item` decimal(10,2) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `fk_periodical_3_idx` (`id_status`),
  KEY `fk_periodical_4_idx` (`id_type`),
  KEY `fk_periodical_1_idx` (`id_theme`),
  CONSTRAINT `fk_periodical_1` FOREIGN KEY (`id_theme`) REFERENCES `themes` (`id`),
  CONSTRAINT `fk_periodical_3` FOREIGN KEY (`id_status`) REFERENCES `periodic_status` (`id`),
  CONSTRAINT `fk_periodical_4` FOREIGN KEY (`id_type`) REFERENCES `types` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf16;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `periodical`
--

LOCK TABLES `periodical` WRITE;
/*!40000 ALTER TABLE `periodical` DISABLE KEYS */;
INSERT INTO `periodical` VALUES (1,'EcoDriver (new edition)','EcoDrive - украинский журнал о экоинновациях, электротранспорте и вторых видах экологически чистого транспорта, инфраструктуре.',1,2,1,23.00),(2,'Украина За рулем','Культовый автомобильный журнал, единственный журнал о автомобилях на всем постсоветском пространстве, имеющий успешную историю издания с 1928 года.',1,2,1,54.00),(3,'Пизнайка от 2 до 6 — журнал для самых маленьких','Первый в Украине журнал для детей от 2 до 6 лет. Комментарии, задачи различных уровней сложности (учитывая возраст ребенка) пригодятся родителям.',1,1,2,23.00),(4,'Пизнайка от 6 — детский журнал','Самый популярный познавательный, игровой и развлекательный журнал для современных детей от 6 лет. Каждый номер - тематический.',1,1,2,65.00),(5,'РОЗУМАШКИ (укр.)','«Розумашка» - журнал для детей 6-9 лет. Развивает, воспитывает, учит в доступной и увлекательной игровой форме. Различные темы журнала дают ответы на вопросы детей.',1,1,2,87.00),(6,'Бабушкин компот','Толстый сборник сканвордов + рецепты!',1,2,3,23.00),(7,'Бабушкин компот. Большие клетки','Различные кроссворды с большими клетками и большим шрифтом плюс судоку, филворды, кейворды и рецепты вкусных блюд.',1,1,3,56.00),(8,'Большой журнал кроссвордов','Около 80 самых разнообразных кроссвордов для ценителей интересных определений и числовых задач. Ежемесячный журнал для умного досуга!',1,1,3,98.00),(9,'Добрые советы','«Добрые советы» - популярный журнал для женщин. Мода, красота, психология. Советы на все случаи жизни.',1,2,3,12.00),(10,'Добрые советы. Сканворды','В журнале - разнообразие сканвордов, юмор и «музыкальные паузы» - известные строки из популярных песен.',1,2,3,34.00),(11,'Кроссворд Лига','Около 70 сканвордов, классических кроссвордов, кейвордов, судоку, «японок» - для всей семьи.',1,1,3,52.00),(12,'Кроссворды для всех','Толстый сборник с различными видами кроссвордов, а также юмор.',1,1,3,67.00),(13,'Кроссворды народов мира. Судоку','«Кроссворды народов мира» (Судоку) - более 80 судоку разных уровней сложности, для новичков и профессионалов.',1,1,3,23.00),(14,'Экспресс газета','Скандалы, сенсации, расследования, истории из жизни звезд.',1,1,3,53.00),(15,'Лабиринт кроссвордов','Оригинальные сканворды, кейворды, чайнворды, судоку.',1,1,3,67.00),(16,'Лабиринт кроссвордов. Суперсборник','Очень толстая сборник первоклассных кроссвордов, сканвордов, кейвордов, судоку на любой вкус от популярного кроссвордных журнала - «Лабиринта кроссвордов»!',1,1,3,21.00),(17,'Лиза кроссворды. Сборник','Толстенный журнал различных кроссвордов - от классических до кейвордов, от судоку к сканвордов - все это в одном сборнике!',1,1,3,23.00),(18,'Лиза.Кейворды','«Лиза. Кейворды »- ежемесячный развлекательный журнал с числовыми головоломками.',1,1,3,45.00),(19,'Отдохни!','Самый популярный еженедельный женский журнал. Красота, мода, здоровье, семья, отдых.',1,1,3,56.00),(20,'Расслабься!','В журнале - скандинавские познавательные кроссворды, сканворды с юмором, карикатуры, афоризмы.',1,1,3,67.00),(21,'Сборная солянка','Сборник различных кроссвордов с рецептами, анекдотами и интересными историями! Текстовые материалы - на украинском языке, кроссворды - на русском.',1,1,3,43.00),(22,'Сделай паузу','Сборник различных кроссвордов.',1,1,3,56.00),(23,'Судоку сложные','Толстая газета головоломок судоку для настоящих ценителей числовых упражнений для ума.',1,1,3,76.00),(24,'Судоку сложные. Спецвипуск','«Судоку сложные. Спецвыпуск »- большой сборник головоломок судоку для настоящих ценителей числовых упражнений для ума.',1,1,3,83.00),(25,'Телегид','«Телегид» - больше чем журнал с программой! Интервью со звездами, сериалы и Кинопремьеры, оригинальные рецепты, красота, здоровье, мода. И страничка юмора!',1,1,3,25.00),(26,'Тетя Соня','Издание кроссвордов с одесским колоритом. Сканворды, кейворды, судоку, одесский юмор и рецепты от одесситки Тети Сони.',1,1,3,34.00),(27,'Тещин язык','Ваш любимый журнал кроссвордов вернулся! Сканворды, кейворды, судоку на любой вкус, анекдоты, много рецептов вкусных блюд от Теще.',1,1,3,22.00),(28,'BURDA','Burda - легендарный журнал о моде, красоте, стиле. Ежемесячно новая коллекция выкроек, готовых для пошива одежды и аксессуаров.',1,1,4,46.00),(29,'Vogue UA','Журнал «VOGUE UA» - библия моды, которая определяет каноны красоты и стандарты моды протягом века. Торговая марка «VOGUE» на рынке с 1892 года.',1,1,4,43.00),(30,'Порадница','Возможность для каждого высказаться, обратиться за помощью и быть услышанным. Полезные советы на все случаи жизни по вопросам здоровья, воспитания детей, отношений.',2,1,4,98.00),(31,'Сабрина','«Сабрина» - универсальный журнал по вязанию на спицах и крючком. Представлены разнообразные модели для женщин любого возраста, имеющих различный опыт.',1,1,4,54.00),(32,'Про ТВ','Пользуетесь программой? Выбирайте лучшую 47 каналов, больше 130 анонсов фильмов и сериалов, интервью, фильмы, мультики и сериалы недели, анекдоты и сканворды.',1,1,5,34.00),(33,'Программка','Ничего лишнего - удобная для читателей даже преклонного возраста программа 26 каналов, больше 100 анонсов лучших фильмов недели, гороскоп, сканворд.',1,1,5,65.00),(34,'Телекурьер','Удобная телепрограмма 35 самых популярных каналов, больше 180 анонсов фильмов и сериалов в каждом номере; 8 сканвордов; гороскоп, кулинария и полезные советы.',1,1,5,75.00),(35,'Теленеделя','Теленеделя (Киев) - самый массовый и Рейтинговый еженедельный журнал о звездах, семейном досуге, телевидении, моде и красоте.',1,1,5,43.00),(36,'Телескоп','Журнал «Телескоп» еженедельный развлекательно-познавательный журнал. В каждом номере «Телескопа» - интересные факты из жизни звезд; телепрограмма, анонсы, афиша.',1,1,5,76.00),(37,'Газета «Все о бухгалтерском учете»','Профессиональная бухгалтерская газета поможет бухгалтерам, экономистам и аудиторам в решении проблем, связанных с бухгалтерским учетом и отчетностью.',2,1,6,34.00),(38,'Деньги.ua','Деньги - персональный деловой журнал. Советует как эффективно и разумно распоряжаться собственным капиталом. Предназначен для людей, Которые ищут информацию.',1,1,6,65.00),(39,'Сельская жизнь в Украине','Новости агробизнеса, технологии, доступная статистика, интересности и идеи в отрасли со всего мира. Хотите узнать, как заработать большие деньги в селе?',2,1,6,76.00),(40,'Люблю готовить','Самый известный кулинарный журнал, созданный по рецептам читателей.',1,1,7,45.00),(41,'Аргументы и факты в Украине Здоровье','Еженедельник',1,1,8,35.00),(42,'Форбс','Полноцветный глянцевый журнал объемом 160 страниц.',1,1,9,65.00),(43,'Аргументы и факты в Украине','Еженедельник',2,1,9,76.00),(44,'Бульвар Гордона','«Бульвар Гордона» - газета с именем, настоящий свидетель современной истории. Люди, судьбы, истории из первых уст.',2,1,9,45.00),(45,'Ваша Судьба-спринт','Деньги, власть, любовь, успех, истории из жизни, новости, звезды - газета об этом и многом другом. Плюс ТВ-программа на неделю.',2,1,9,21.00),(46,'Вести. Всеукраинский выпуск','Новости Украины и мира, здоровье, спорт, культура и отдых.',1,1,9,32.00),(47,'Газета по-украински','Газета для всей семьи: о политике, деньгах, скандалах, известных людях, спорте, культуре. Выходит еженедельно в четверг на 16 страницах без программы ТВ.',2,1,9,54.00),(48,'Газета по-украински. Дом, Здоровье, еда, Сад-Огород','Газета для всей семьи: в доме, здоровье, еде, саде-огороде. Только полезные и действенные советы.',2,2,9,65.00),(49,'Газета по-украински (с ТВ)','Газета для всей семьи: о политике, деньгах, скандалах, известных людях, спорте, культуре. Удобная программа центральных и самых популярных каналов кабельного ТВ.',2,1,9,76.00),(50,'Журнал «Страна»','Журнал пишет откровенно обо всем происходящем в Украине и мире. Интересные интервью с известными людьми и простыми украинца. Легко, глубоко и неожиданно.',1,1,9,34.00),(51,'Комплект «Газета по-украински» + «Газета по-украински. Дом, Здоровье, еда, Сад-Огород»','Газета для всей семьи: о политике, деньгах, скандалах, известных людях, спорте, культуре.',2,1,9,56.00),(52,'Комплект «Газета по-украински (з ТВ)','Еженедельник',2,1,9,68.00),(53,'Корреспондент','Самый известный новостной журнал Украины Весь мир в одном журнале! Самые важные и интересные материалы в сфере бизнеса, политики, общества, науки, культуры и спорта.',1,1,9,79.00),(54,'КП в Украине — Четверг (Киевский выпуск)','Газета, выпускающаяся с 1925 года, в течение многих десятилетий имеет огромную читательскую аудиторию.',2,1,9,54.00),(55,'Новое время','Общественно-политический еженедельный журнал «Новое время страны». Долгожданный проект на информационном пространстве. Новая современная Украина.',1,1,9,43.00),(56,'Совершенно секретно — Украина','Газета с прочной репутацией незаангажированного издания, где непредвзято подается информация о известных людях и событиях в области политики, истории, искусства.',2,1,9,54.00),(57,'Совершенно секретно — Украина. Спецвыпуск','Тематический дайджест лучших материалов газеты «Совершенно секретно».',1,1,9,76.00),(58,'Фокус','«Фокус» - еженедельный русскоязычный общенациональный социально-политический журнал. Издание дает читателю актуальную аналитическую информацию.',1,1,9,87.00),(59,'Журнал «Футбол»','Журнал \"Футбол\" - самая полная информация из мира футбола В каждом номере: Отчёты и результаты матчей в еврокубках и национальных чемпионатов.',1,1,10,43.00),(60,'Олимпийская арена','Спортивное издание в Украине - журнал «Олимпийская арена», который является органом Национального олимпийского комитета Украины.',1,1,10,67.00);
/*!40000 ALTER TABLE `periodical` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-06-11 14:43:32
